TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_hrpwm.h
//###########################################################################
//
// FILE:    hw_hrpwm.h
//
// TITLE:   Definitions for the HRPWM registers.
//
//###########################################################################
// 
// C2000Ware v26.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_HRPWM_H
#define HW_HRPWM_H

//*************************************************************************************************
//
// The following are defines for the HRPWM register offsets
//
//*************************************************************************************************
#define HRPWM_O_TBCTL              0x0U    // Time Base Control Register
#define HRPWM_O_TBCTL2             0x1U    // Time Base Control Register 2
#define HRPWM_O_EPWMSYNCINSEL      0x3U    // EPWMxSYNCIN Source Select Register
#define HRPWM_O_TBCTR              0x4U    // Time Base Counter Register
#define HRPWM_O_TBSTS              0x5U    // Time Base Status Register
#define HRPWM_O_EPWMSYNCOUTEN      0x6U    // EPWMxSYNCOUT Source Enable Register
#define HRPWM_O_TBCTL3             0x7U    // Time Base Control Register 3
#define HRPWM_O_CMPCTL             0x8U    // Counter Compare Control Register
#define HRPWM_O_CMPCTL2            0x9U    // Counter Compare Control Register 2
#define HRPWM_O_DBCTL              0xCU    // Dead-Band Generator Control Register
#define HRPWM_O_DBCTL2             0xDU    // Dead-Band Generator Control Register 2
#define HRPWM_O_AQCTL              0x10U   // Action Qualifier Control Register
#define HRPWM_O_AQTSRCSEL          0x11U   // Action Qualifier Trigger Event Source Select Register
#define HRPWM_O_PCCTL              0x14U   // PWM Chopper Control Register
#define HRPWM_O_VCAPCTL            0x18U   // Valley Capture Control Register
#define HRPWM_O_VCNTCFG            0x19U   // Valley Counter Config Register
#define HRPWM_O_HRCNFG             0x20U   // HRPWM Configuration Register
#define HRPWM_O_HRCNFG2            0x27U   // HRPWM Configuration 2 Register
#define HRPWM_O_HRPCTL             0x2DU   // High Resolution Period Control Register
#define HRPWM_O_TRREM              0x2EU   // HRPWM High Resolution Remainder Register
#define HRPWM_O_GLDCTL             0x34U   // Global PWM Load Control Register
#define HRPWM_O_GLDCFG             0x35U   // Global PWM Load Config Register
#define HRPWM_O_EPWMXLINK          0x38U   // EPWMx Link Register
#define HRPWM_O_EPWMXLINK2         0x3AU   // EPWMx Link 2 Register
#define HRPWM_O_AQCTLA             0x40U   // Action Qualifier Control Register For Output A
#define HRPWM_O_AQCTLA2            0x41U   // Additional Action Qualifier Control Register For
                                           // Output A
#define HRPWM_O_AQCTLB             0x42U   // Action Qualifier Control Register For Output B
#define HRPWM_O_AQCTLB2            0x43U   // Additional Action Qualifier Control Register For
                                           // Output B
#define HRPWM_O_AQSFRC             0x47U   // Action Qualifier Software Force Register
#define HRPWM_O_AQCSFRC            0x49U   // Action Qualifier Continuous S/W Force Register
#define HRPWM_O_DBREDHR            0x50U   // Dead-Band Generator Rising Edge Delay High Resolution
                                           // Mirror Register
#define HRPWM_O_DBRED              0x51U   // Dead-Band Generator Rising Edge Delay High Resolution
                                           // Mirror Register
#define HRPWM_O_DBFEDHR            0x52U   // Dead-Band Generator Falling Edge Delay High
                                           // Resolution Register
#define HRPWM_O_DBFED              0x53U   // Dead-Band Generator Falling Edge Delay Count Register
#define HRPWM_O_TBPHS              0x60U   // Time Base Phase High
#define HRPWM_O_TBPRDHR            0x62U   // Time Base Period High Resolution Register
#define HRPWM_O_TBPRD              0x63U   // Time Base Period Register
#define HRPWM_O_CMPA               0x6AU   // Counter Compare A Register
#define HRPWM_O_CMPB               0x6CU   // Compare B Register
#define HRPWM_O_CMPC               0x6FU   // Counter Compare C Register
#define HRPWM_O_CMPD               0x71U   // Counter Compare D Register
#define HRPWM_O_GLDCTL2            0x74U   // Global PWM Load Control Register 2
#define HRPWM_O_SWVDELVAL          0x77U   // Software Valley Mode Delay Register
#define HRPWM_O_TZSEL              0x80U   // Trip Zone Select Register
#define HRPWM_O_TZSEL2             0x81U   // Trip Zone Select Register 2
#define HRPWM_O_TZDCSEL            0x82U   // Trip Zone Digital Comparator Select Register
#define HRPWM_O_TZCTL              0x84U   // Trip Zone Control Register
#define HRPWM_O_TZCTL2             0x85U   // Additional Trip Zone Control Register
#define HRPWM_O_TZCTLDCA           0x86U   // Trip Zone Control Register Digital Compare A
#define HRPWM_O_TZCTLDCB           0x87U   // Trip Zone Control Register Digital Compare B
#define HRPWM_O_TZEINT             0x8DU   // Trip Zone Enable Interrupt Register
#define HRPWM_O_TZFLG              0x93U   // Trip Zone Flag Register
#define HRPWM_O_TZCBCFLG           0x94U   // Trip Zone CBC Flag Register
#define HRPWM_O_TZOSTFLG           0x95U   // Trip Zone OST Flag Register
#define HRPWM_O_TZCLR              0x97U   // Trip Zone Clear Register
#define HRPWM_O_TZCBCCLR           0x98U   // Trip Zone CBC Clear Register
#define HRPWM_O_TZOSTCLR           0x99U   // Trip Zone OST Clear Register
#define HRPWM_O_TZFRC              0x9BU   // Trip Zone Force Register
#define HRPWM_O_TZTRIPOUTSEL       0x9DU   // Trip Out Select Register
#define HRPWM_O_ETSEL              0xA4U   // Event Trigger Selection Register
#define HRPWM_O_ETPS               0xA6U   // Event Trigger Pre-Scale Register
#define HRPWM_O_ETFLG              0xA8U   // Event Trigger Flag Register
#define HRPWM_O_ETCLR              0xAAU   // Event Trigger Clear Register
#define HRPWM_O_ETFRC              0xACU   // Event Trigger Force Register
#define HRPWM_O_ETINTPS            0xAEU   // Event-Trigger Interrupt Pre-Scale Register
#define HRPWM_O_ETSOCPS            0xB0U   // Event-Trigger SOC Pre-Scale Register
#define HRPWM_O_ETCNTINITCTL       0xB2U   // Event-Trigger Counter Initialization Control Register
#define HRPWM_O_ETCNTINIT          0xB4U   // Event-Trigger Counter Initialization Register
#define HRPWM_O_ETINTMIXEN         0xB6U   // Event-Trigger Mixed INT Selection
#define HRPWM_O_ETSOCAMIXEN        0xB8U   // Event-Trigger Mixed SOCA Selection
#define HRPWM_O_ETSOCBMIXEN        0xBAU   // Event-Trigger Mixed SOCB Selection
#define HRPWM_O_DCTRIPSEL          0xC0U   // Digital Compare Trip Select Register
#define HRPWM_O_DCACTL             0xC3U   // Digital Compare A Control Register
#define HRPWM_O_DCBCTL             0xC4U   // Digital Compare B Control Register
#define HRPWM_O_DCFCTL             0xC7U   // Digital Compare Filter Control Register
#define HRPWM_O_DCCAPCTL           0xC8U   // Digital Compare Capture Control Register
#define HRPWM_O_DCFOFFSET          0xC9U   // Digital Compare Filter Offset Register
#define HRPWM_O_DCFOFFSETCNT       0xCAU   // Digital Compare Filter Offset Counter Register
#define HRPWM_O_DCFWINDOW          0xCBU   // Digital Compare Filter Window Register
#define HRPWM_O_DCFWINDOWCNT       0xCCU   // Digital Compare Filter Window Counter Register
#define HRPWM_O_BLANKPULSEMIXSEL   0xCDU   // Blanking window trigger pulse select register
#define HRPWM_O_DCCAPMIXSEL        0xCEU   // Capture Event pulse select register
#define HRPWM_O_DCCAP              0xCFU   // Digital Compare Counter Capture Register
#define HRPWM_O_DCAHTRIPSEL        0xD2U   // Digital Compare AH Trip Select
#define HRPWM_O_DCALTRIPSEL        0xD3U   // Digital Compare AL Trip Select
#define HRPWM_O_DCBHTRIPSEL        0xD4U   // Digital Compare BH Trip Select
#define HRPWM_O_DCBLTRIPSEL        0xD5U   // Digital Compare BL Trip Select
#define HRPWM_O_CAPCTL             0xD6U   // Event Capture Control Register
#define HRPWM_O_CAPGATETRIPSEL     0xD7U   // Event Capture Gate Trip input select
#define HRPWM_O_CAPINTRIPSEL       0xD8U   // Event Capture Trip input select
#define HRPWM_O_CAPTRIPSEL         0xD9U   // Event Capture Signal Select
#define HRPWM_O_EPWMLOCK           0xFAU   // EPWM Lock Register
#define HRPWM_O_HWVDELVAL          0xFDU   // Hardware Valley Mode Delay Register
#define HRPWM_O_VCNTVAL            0xFEU   // Hardware Valley Counter Register

